tutorials/fluidSolidInteraction/heatTransfer/thermalCavity/constant/solid/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress no;

mechanical
(
    steel
    {
        type            thermoMechanicalLaw;
        rho             rho [1 -3 0 0 0 0 0] 1;
        alpha           alpha [0 0 0 -1 0 0 0] 1e-05;
        T0              T0 [0 0 0 1 0 0 0] 0;
        
        mechanicalLaw
        {
            type            linearElastic;
            E               E [1 -1 -2 0 0 0 0] 2e+11;
            nu              nu [0 0 0 0 0 0 0] 0.3;
        }
    }
);

// ************************************************************************* //
