tutorials/fluidSolidInteraction/heatTransfer/thermalCavity/system/solid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

d2dt2Schemes
{
    default            backward;
}

ddtSchemes
{
    default            backward;
}

gradSchemes
{
    default            Gauss linear;
}

divSchemes
{
    default            Gauss linear;
}

laplacianSchemes
{
    default  Gauss linear uncorrected;
}

snGradSchemes
{
    default            uncorrected;
}

interpolationSchemes
{
    default linear;
}


// ************************************************************************* //
