tutorials/fluidSolidInteraction/heatTransfer/thermalCavity/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Dp
    {
        solver			BiCGStab;
        preconditioner	Cholesky;

        minIter			1;
        maxIter			5000;

        tolerance		1e-13;
        relTol			1e-2;
    }

    T
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0.01;
        minIter         1;
        maxIter         100;
    }
}

relaxationFactors
{
    // fields
    // {
    //     p               1; //0.5; //0.05;
    //     pFinal          1; //0.05;
    //     D               1; //0.98;
    //     UFinal          1; //0.98;

    //     nonLinForceCorrection 0.5;
    // }

    // equations
    // {
    //     D               0.99; //0.98;
    //     DFinal          0.99; //0.98;
    // }

    // Under-relaxating the DD equation by 0.99-0.9999 can improve convergence in
    // some cases, in particular when there are solidContact boundaries
    //DEqn   0.999;
    //DDEqn   0.999;

    // Under-relaxating the DD field by 0.1-0.9 can improve convergence in some
    // cases
    D      0.9;
    DD      0.9;
}

// ************************************************************************* //
